Zeilen zu einem Dataframe hinzufügen

In [2]:
import pandas as pd

Beispiel: Studenten

In [3]:
df = pd.read_excel("dataprojects/merge/students.xlsx")

In [4]:
df

         id    name                  kurs
0  2022-001    Adam  CAS Datenjournlismus
1  2022-002   Doris  CAS Datenjournlismus
2  2022-003   Greta  Reportagen schreiben
3  2022-004     Ida  Reportagen schreiben
4  2022-005  Eduard  CAS Datenjournlismus
5  2022-006   Berta  CAS Datenjournlismus
6  2022-007    Carl  CAS Datenjournlismus
7  2022-008   Falco  Reportagen schreiben
8  2022-009   Jakob  Reportagen schreiben

Wir wollen folgenden Eintrag hinzufügen:

In [5]:
new_student = {
    "id": "2022-010",
    "name": "Kurt",
    "kurs": "Reportagen schreiben"
}

### Alte Methode: append()

Produziert Warning, geht aber immer noch:

In [6]:
df.append(new_student, ignore_index=True)

/var/folders/y4/4cj_z2tj0vz904cw1wtz5z0c0000gn/T/ipykernel_38096/2129537381.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(new_student, ignore_index=True)

         id    name                  kurs
0  2022-001    Adam  CAS Datenjournlismus
1  2022-002   Doris  CAS Datenjournlismus
2  2022-003   Greta  Reportagen schreiben
3  2022-004     Ida  Reportagen schreiben
4  2022-005  Eduard  CAS Datenjournlismus
5  2022-006   Berta  CAS Datenjournlismus
6  2022-007    Carl  CAS Datenjournlismus
7  2022-008   Falco  Reportagen schreiben
8  2022-009   Jakob  Reportagen schreiben
9  2022-010    Kurt  Reportagen schreiben

### Neue Methode: pd.concat()

Schritt 1: neues Mini-DF erstellen

In [9]:
df_new = pd.DataFrame([new_student])
df_new

Schritt 2: Die beiden DFs verbinden

In [12]:
pd.concat([df, df_new], ignore_index=True)

         id    name                  kurs
0  2022-001    Adam  CAS Datenjournlismus
1  2022-002   Doris  CAS Datenjournlismus
2  2022-003   Greta  Reportagen schreiben
3  2022-004     Ida  Reportagen schreiben
4  2022-005  Eduard  CAS Datenjournlismus
5  2022-006   Berta  CAS Datenjournlismus
6  2022-007    Carl  CAS Datenjournlismus
7  2022-008   Falco  Reportagen schreiben
8  2022-009   Jakob  Reportagen schreiben
9  2022-010    Kurt  Reportagen schreiben

### Oder folgender Trick: df.loc[]

Das funktioniert gut, wenn der Index einfach eine Zahl ist

In [15]:
df.loc[len(df)] = new_student

In [16]:
df

         id    name                  kurs
0  2022-001    Adam  CAS Datenjournlismus
1  2022-002   Doris  CAS Datenjournlismus
2  2022-003   Greta  Reportagen schreiben
3  2022-004     Ida  Reportagen schreiben
4  2022-005  Eduard  CAS Datenjournlismus
5  2022-006   Berta  CAS Datenjournlismus
6  2022-007    Carl  CAS Datenjournlismus
7  2022-008   Falco  Reportagen schreiben
8  2022-009   Jakob  Reportagen schreiben
9  2022-010    Kurt  Reportagen schreiben